src/toir_cfe/src/DataProcessors/проф_ПрогнозныйРасчетТМЦ/проф_ПрогнозныйРасчетТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>проф_ПрогнозныйРасчетТМЦ</name>
  <attributes>
    <name>ДатаПлана</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеИсполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьАналоги</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>УстановленыАналоги</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлановыйРасходПоППР</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОстаткиНаСкладахТОиРТекущие</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОстаткиНаЦентральномСкладе</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПрогнозныйРасход</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗВП</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заказано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПлановаяДатаПоставки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеЗакупки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВПути</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПрогнозДатыПступления</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПрогнозныеОстаткиНаСкладах</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МинимальныйОстаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИспользоватьАналог</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РекомендованоКЗакупке</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПланЗакупок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПометитьКФормированиюПланаЗакупок</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/toir_cfe/src/AccumulationRegisters/проф_ТоварыНаСкладах/проф_ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3f2b5e01-847b-49d9-b668-ee6122445039">
  <name>проф_ТоварыНаСкладах</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="78a7323c-7389-4599-84d6-fde6c3c3533d">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="9c39d63c-41cb-4486-a9ee-180052b85921">
    <name>КонтролироватьОстатки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="8289f7d9-fa0a-45f7-be0c-238495f87a84">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="8df19511-0c7e-41a8-90eb-f953e351a534">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="bd312888-71b8-45b3-bbf7-970c05bc2727">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="951359e6-820e-4f61-a602-16a239f40091">
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="328ce0e5-8d0f-4315-8e53-033acc81fdd0">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

src/toir_cfe/src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="80440cbb-f97b-4620-8eca-b89f9a033f08">
  <name>ТоварыНаСкладах</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="2d1fe73e-1f3d-4ee9-9dd1-010dfff742b1">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="70b08d50-30e9-4115-9e39-67ef989c58b2">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="c9fd5a1a-3aa5-4048-b15e-f8b6a41ab96f">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="29d5a4e7-4544-4ed2-a8bf-d541eef13703">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="f81fa13f-989c-43f8-a8bc-c4493200a00f">
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

src/toir_cfe/src/AccumulationRegisters/проф_ЗаказыПоставщику/проф_ЗаказыПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="13b3dbe6-068e-4230-9851-c9b16955da47">
  <name>проф_ЗаказыПоставщику</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="e948a823-3feb-4e2d-a6c4-c3534bea1ef0">
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="61aa1b48-840d-41e9-8da7-96d94fcae806">
    <name>ДатаПоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <dimensions extendedConfigurationObject="6c906e57-098b-4b4c-9470-49e9ae5b2947">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="1fa0deb6-40e2-4ca6-8cd5-d100464cd979">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="2295257b-d9db-4394-91c2-e6a46dcd82d7">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="a3408ac2-5051-43da-aa84-1d6b40936797">
    <name>ЗаказПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="202c1c8c-4f45-46da-9e57-827f13e99ce4">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

src/toir_cfe/src/InformationRegisters/торо_АналогиНоменклатурыДляРемонтов/торо_АналогиНоменклатурыДляРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="bd75473a-e6a0-45ee-a83a-941e99a8d526">
  <name>торо_АналогиНоменклатурыДляРемонтов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="810e87f2-60ec-4c6f-a698-b46ac061bf7a">
    <name>ПериодЗавершения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="b7da3a7a-7f93-4d82-b739-a7fce6b51bb5">
    <name>УпаковкаМатериала</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="a912cf23-ea02-49c6-9436-c42a62dc455e">
    <name>КоличествоМатериала</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="62b487cf-3318-420c-850b-a279c9ea8cdc">
    <name>КоличествоУпаковокМатериала</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="ce89a4f9-62f1-4509-a089-dce3ae891031">
    <name>УпаковкаАналога</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="5153709f-d763-4f1c-b0b0-4662a1f640f4">
    <name>КоличествоАналога</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="8cec5131-0504-466d-ac20-43194aba1d2c">
    <name>КоличествоУпаковокАналога</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="59851635-0a58-4b1c-8731-113c1e7c611e">
    <name>Материал</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="0abaad15-010c-4720-b462-1a1169662393">
    <name>ХарактеристикаМатериала</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="3e0ba762-2301-4507-bb58-f8a616708252">
    <name>ТехКарта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="3abcbaea-a6e9-479b-956d-13dc9e932eb0">
    <name>КлючСвязиСпецификация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="1ea4a6a3-d4bb-4680-a389-ddbe5b71d9c8">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="21559ab3-21fe-4274-93d2-bead9faf4226">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="554b3f39-42e7-4c9c-93d9-4d44f5dc9c0d">
    <name>ВидРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="ad8d66e2-91c2-4772-a887-4764fd6f2379">
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="80a5eaa4-3b19-491a-84a3-998bc6f03267">
    <name>НаправлениеОбъектаРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="49bd9538-5775-49d3-a7d5-ee278e515679">
    <name>Аналог</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="df826c69-f7c0-41bd-a065-365bf48abb7e">
    <name>ХарактеристикаАналога</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cfe/src/DataProcessors/проф_ПрогнозныйРасчетТМЦ/Forms/Форма/Module.bsl
//++ Проф-ИТ, #167, Сергеев Д., 15.09.2023

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ИспользоватьАналоги = Истина;
	
	УстановитьВидимостьЭлементовИспользоватьАналоги();	
	Объект.Ответственный = Пользователи.АвторизованныйПользователь();
	Объект.Автор         = Объект.Ответственный;
	объект.ДатаПлана     = ТекущаяДата();
	
	//++ Проф-ИТ, #377, Соловьев А.А., 30.11.2023
	ТипЦены = Константы.торо_ТипЦеныДляРасчетаСебестоимостиРемонта.Получить();
	Валюта = Константы.ВалютаУправленческогоУчета.Получить();
	//-- Проф-ИТ, #377, Соловьев А.А., 30.11.2023
	
	//++ Проф-ИТ, #437, Соловьев А.А., 19.01.2024
	ПодразделенияСлужбыТОИР = Справочники.проф_НастройкиСистемы.ПолучитьСпЗначНастройкиСистемы(
		"Подразделения", "ПодразделенияСлужбыТОИР");
	проф_ОбщегоНазначенияВызовСервера.ВывестиТоварыВПути(ЭтотОбъект, Номенклатура, ПодразделенияСлужбыТОИР, ЭтотОбъект);
	//-- Проф-ИТ, #437, Соловьев А.А., 19.01.2024
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользоватьАналогиПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементовИспользоватьАналоги();  
	ЗаполнитьОбновитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	ЗаполнитьОбновитьНаСервере();
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьОбновить(Команда)
	ЗаполнитьОбновитьНаСервере();
	//++ Проф-ИТ, #437, Соловьев А.А., 19.01.2024
	Элементы["СписокТоварыВПути"].Обновить();
	//-- Проф-ИТ, #437, Соловьев А.А., 19.01.2024
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПланЗакупок(Команда) 
	
	Форма = ПолучитьФорму("Документ.проф_ПланЗакупок.Форма.ФормаДокумента");
	ДанныеФормы = Форма.Объект; // Получаем объект формы в переменную
	ЗаполнитьДокументНаСервере(ДанныеФормы); // Заполняем документ на сервере
	КопироватьДанныеФормы(ДанныеФормы, Форма.Объект); // копируем наш объект в объект формы и далее открываем ее
	Форма.Открыть();
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыМатериалыДерево

&НаКлиенте
Процедура МатериалыДеревоИспользоватьАналогПриИзменении(Элемент) 
	
	МатериалыДеревоИспользоватьАналогПриИзмененииНаСервере();
	
	текДанные = Элементы.МатериалыДерево.ТекущиеДанные;
	текАналог = текДанные.Номенклатура;
		
	ПараметрыОтбора = Новый Структура("Аналог", текАналог);
    НайденныеСтроки = Аналоги.НайтиСтроки(ПараметрыОтбора);  
	Если НайденныеСтроки.Количество() > 0 Тогда
		НайденныеСтроки[0].ИспользоватьАналог = ПолучитьСуммуИспользоватьАналог(текАналог);
		Если НайденныеСтроки[0].ПрогнозныеОстаткиНаСкладах = 0 Тогда
			НайденныеСтроки[0].НераспределенныйОстаток = НайденныеСтроки[0].ОстаткиНаСкладахТОиРТекущие
				+ НайденныеСтроки[0].ОстаткиНаЦентральномСкладе
				- НайденныеСтроки[0].ИспользоватьАналог;
		Иначе
			НайденныеСтроки[0].НераспределенныйОстаток = НайденныеСтроки[0].ПрогнозныеОстаткиНаСкладах
				- НайденныеСтроки[0].ИспользоватьАналог;		 
		КонецЕсли;	
		
		// Пересчитать Запланировано для замены в качестве аналога 
		ЭлементыКорняДерева = МатериалыДерево.ПолучитьЭлементы();
		Для каждого СтрокаНоменклатура Из ЭлементыКорняДерева Цикл
			Если СтрокаНоменклатура.Номенклатура = текАналог Тогда
				
				СтрокаНоменклатура.ЗапланированоАналог = НайденныеСтроки[0].ИспользоватьАналог;
				
				Если Объект.ИспользоватьАналоги Тогда
					СтрокаНоменклатура.РекомендованоКЗакупке = СтрокаНоменклатура.ПлановыйРасходПоППР 
					- СтрокаНоменклатура.ПрогнозныеОстаткиНаСкладах 
					+ СтрокаНоменклатура.МинимальныйОстаток
					- СтрокаНоменклатура.ИспользоватьАналог
					+ СтрокаНоменклатура.ЗапланированоАналог;
				Иначе
					СтрокаНоменклатура.РекомендованоКЗакупке = СтрокаНоменклатура.ПлановыйРасходПоППР 
					- СтрокаНоменклатура.ПрогнозныеОстаткиНаСкладах 
					+ СтрокаНоменклатура.МинимальныйОстаток;		
				КонецЕсли;
				СтрокаНоменклатура.РекомендованоКЗакупке = ?(СтрокаНоменклатура.РекомендованоКЗакупке < 0, 0, СтрокаНоменклатура.РекомендованоКЗакупке);				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли; 
	
	ПересчитатьСуммуНоменклатуры(текДанные.НоменклатураРодитель); 
	
КонецПроцедуры  

&НаСервере
Процедура МатериалыДеревоИспользоватьАналогПриИзмененииНаСервере()

	

КонецПроцедуры // МатериалыДеревоИспользоватьАналогПриИзмененииНаСервере()

&НаКлиенте
Процедура МатериалыДеревоПриАктивизацииСтроки(Элемент)
	УстановитьОтборНаСвязанныеТаблицы();
КонецПроцедуры 

//++ Проф-ИТ, #377, Соловьев А.А., 30.11.2023
&НаКлиенте
Процедура МатериалыДеревоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.МатериалыДерево.ТекущиеДанные;
	ТекущиеДанные.ПлановаяСтоимость = ТекущиеДанные.ПлановаяЦена * ТекущиеДанные.РекомендованоКЗакупке;
	
	СуммаКЗакупке = 0;
	
	СтрокиДерева = МатериалыДерево.ПолучитьЭлементы();
	
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		Если СтрокаДерева.ПометитьКФормированиюПланаЗакупок Тогда 
			СуммаКЗакупке = СуммаКЗакупке + СтрокаДерева.ПлановаяСтоимость;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
//-- Проф-ИТ, #377, Соловьев А.А., 30.11.2023

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьОтборНаСвязанныеТаблицы()
	
	ТекущиеДанные = Элементы.МатериалыДерево.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		текНоменклатура = ?(ЗначениеЗаполнено(ТекущиеДанные.НоменклатураРодитель), ТекущиеДанные.НоменклатураРодитель, ТекущиеДанные.Номенклатура);
		ОтборСтрок = Новый Структура("Материал", текНоменклатура);
		Элементы.Аналоги.ОтборСтрок = Новый ФиксированнаяСтруктура(ОтборСтрок);
		
		ОтборСтрок = Новый Структура("Номенклатура", текНоменклатура);
		Элементы.ДокументыПланРасход.ОтборСтрок = Новый ФиксированнаяСтруктура(ОтборСтрок);
		Элементы.ДокументыПланРасходТекПериод.ОтборСтрок = Новый ФиксированнаяСтруктура(ОтборСтрок);
		
		//++ Проф-ИТ, #437, Соловьев А.А., 19.01.2024
		ЭтотОбъект["СписокТоварыВПути"].Отбор.Элементы.Очистить();
		
		ЭлементОтбора = ЭтотОбъект["СписокТоварыВПути"].Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = ТекущиеДанные.Номенклатура;
		//-- Проф-ИТ, #437, Соловьев А.А., 19.01.2024
		
	//++ Проф-ИТ, #377, Соловьев А.А., 30.11.2023
		ОтборСтрокОстатки = Новый Структура("Номенклатура", ТекущиеДанные.Номенклатура);
	Иначе
		ОтборСтрокОстатки = Новый Структура("Номенклатура", ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
	//-- Проф-ИТ, #377, Соловьев А.А., 30.11.2023
	КонецЕсли;
	
	Элементы.ОстаткиПоСкладам.ОтборСтрок = Новый ФиксированнаяСтруктура(ОтборСтрокОстатки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуНоменклатуры(НомРодитель)

	ИспользоватьАналогСумма = 0;
	ЭлементыКорняДерева = МатериалыДерево.ПолучитьЭлементы();
	
	Для каждого СтрокаНоменклатура Из ЭлементыКорняДерева Цикл
		Если СтрокаНоменклатура.Номенклатура = НомРодитель Тогда
			
			СтрокиАналоги = СтрокаНоменклатура.ПолучитьЭлементы();
			
			Для каждого СтрокаАналог Из СтрокиАналоги Цикл
				ИспользоватьАналогСумма = ИспользоватьАналогСумма + СтрокаАналог.ИспользоватьАналог;
			КонецЦикла;
			
			СтрокаНоменклатура.ИспользоватьАналог = ИспользоватьАналогСумма;
			Если Объект.ИспользоватьАналоги Тогда
				СтрокаНоменклатура.РекомендованоКЗакупке = СтрокаНоменклатура.ПлановыйРасходПоППР 
															- СтрокаНоменклатура.ПрогнозныеОстаткиНаСкладах 
															+ СтрокаНоменклатура.МинимальныйОстаток
															- СтрокаНоменклатура.ИспользоватьАналог
															+ СтрокаНоменклатура.ЗапланированоАналог;
			Иначе
				СтрокаНоменклатура.РекомендованоКЗакупке = СтрокаНоменклатура.ПлановыйРасходПоППР 
															- СтрокаНоменклатура.ПрогнозныеОстаткиНаСкладах 
															+ СтрокаНоменклатура.МинимальныйОстаток;
			КонецЕсли;
			СтрокаНоменклатура.РекомендованоКЗакупке = ?(СтрокаНоменклатура.РекомендованоКЗакупке < 0, 0, СтрокаНоменклатура.РекомендованоКЗакупке);
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОбновитьНаСервере()
	
	МатериалыДерево.ПолучитьЭлементы().Очистить();
	Аналоги.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	торо_ПлановыеРемонтныеРаботы.ID КАК ID,
	|	торо_ПлановыеРемонтныеРаботы.Регистратор КАК Регистратор,
	|	торо_ПлановыеРемонтныеРаботы.Период КАК Период
	|ПОМЕСТИТЬ ВТ_ID_Регистратор_Период
	|ИЗ
	|	РегистрСведений.торо_ПлановыеРемонтныеРаботы КАК торо_ПлановыеРемонтныеРаботы
	|ГДЕ
	|	торо_ПлановыеРемонтныеРаботы.ДатаНачалаРемонтныхРабот >= &ДатаНачала
	|	И торо_ПлановыеРемонтныеРаботы.ДатаОкончанияРемонтныхРабот <= &ДатаОкончания
	|	И НЕ торо_ПлановыеРемонтныеРаботы.Отменен
	|	И НЕ торо_ПлановыеРемонтныеРаботы.Замещен
	|	И торо_ПлановыеРемонтныеРаботы.Подразделение = &Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ID_Регистратор_Период.ID КАК ID,
	|	МАКСИМУМ(ВТ_ID_Регистратор_Период.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_ID_МаксПериод
	|ИЗ
	|	ВТ_ID_Регистратор_Период КАК ВТ_ID_Регистратор_Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ID_Регистратор_Период.ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ID_Регистратор_Период.ID КАК ID,
	|	ВТ_ID_Регистратор_Период.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТ_ID_Регистратор
	|ИЗ
	|	ВТ_ID_Регистратор_Период КАК ВТ_ID_Регистратор_Период
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ID_МаксПериод КАК ВТ_ID_МаксПериод
	|		ПО ВТ_ID_Регистратор_Период.ID = ВТ_ID_МаксПериод.ID
	|			И ВТ_ID_Регистратор_Период.Период = ВТ_ID_МаксПериод.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ID.ID КАК ID
	|ПОМЕСТИТЬ ВТ_ID
	|ИЗ
	|	ВТ_ID_Регистратор_Период КАК ВТ_ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	торо_ПлановыеРемонтныеРаботы.ID КАК ID,
	|	торо_ПлановыеРемонтныеРаботы.Регистратор КАК Регистратор,
	|	торо_ПлановыеРемонтныеРаботы.Период КАК Период
	|ПОМЕСТИТЬ ВТ_ID_ТекПериод_Регистратор_Период
	|ИЗ
	|	РегистрСведений.торо_ПлановыеРемонтныеРаботы КАК торо_ПлановыеРемонтныеРаботы
	|ГДЕ
	|	торо_ПлановыеРемонтныеРаботы.ДатаНачалаРемонтныхРабот >= &ДатаПлана
	|	И торо_ПлановыеРемонтныеРаботы.ДатаОкончанияРемонтныхРабот < &ДатаНачала
	|	И НЕ торо_ПлановыеРемонтныеРаботы.Отменен
	|	И НЕ торо_ПлановыеРемонтныеРаботы.Замещен
	|	И торо_ПлановыеРемонтныеРаботы.Подразделение = &Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ID_ТекПериод_Регистратор_Период.ID КАК ID,
	|	МАКСИМУМ(ВТ_ID_ТекПериод_Регистратор_Период.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_ID_ТекПериод_МаксПериод
	|ИЗ
	|	ВТ_ID_ТекПериод_Регистратор_Период КАК ВТ_ID_ТекПериод_Регистратор_Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ID_ТекПериод_Регистратор_Период.ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ID_ТекПериод_Регистратор.ID КАК ID
	|ПОМЕСТИТЬ ВТ_ID_ТекПериод
	|ИЗ
	|	ВТ_ID_ТекПериод_Регистратор_Период КАК ВТ_ID_ТекПериод_Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ID_ТекПериод_Регистратор_Период.Регистратор КАК Регистратор,
	|	ВТ_ID_ТекПериод_Регистратор_Период.ID КАК ID
	|ПОМЕСТИТЬ ВТ_ID_ТекПериод_Регистратор
	|ИЗ
	|	ВТ_ID_ТекПериод_МаксПериод КАК ВТ_ID_ТекПериод_МаксПериод
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ID_ТекПериод_Регистратор_Период КАК ВТ_ID_ТекПериод_Регистратор_Период
	|		ПО ВТ_ID_ТекПериод_МаксПериод.ID = ВТ_ID_ТекПериод_Регистратор_Период.ID
	|			И ВТ_ID_ТекПериод_МаксПериод.Период = ВТ_ID_ТекПериод_Регистратор_Период.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	СУММА(ВложенныйЗапрос.Количество) КАК Количество,
	|	ВложенныйЗапрос.ID КАК ID
	|ПОМЕСТИТЬ ВТ_Запчасти_ID
	|ИЗ
	|	(ВЫБРАТЬ
	|		тЗапчасти.Номенклатура КАК Номенклатура,
	|		тЗапчасти.Количество КАК Количество,
	|		ВТ_ID.ID КАК ID
	|	ИЗ
	|		Документ.торо_ПроектныеЗатратыНаРемонты.Запчасти КАК тЗапчасти
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ПроектныеЗатратыНаРемонты КАК торо_ПроектныеЗатратыНаРемонты
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ID КАК ВТ_ID
	|				ПО (ВТ_ID.ID = торо_ПроектныеЗатратыНаРемонты.IDРемонта)
	|			ПО тЗапчасти.Ссылка = торо_ПроектныеЗатратыНаРемонты.Ссылка
	|			И торо_ПроектныеЗатратыНаРемонты.ОбъектРемонта В (&ОбъектРемонта)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		тМатериальныеЗатраты.Номенклатура,
	|		тМатериальныеЗатраты.Количество,
	|		ВТ_ID.ID
	|	ИЗ
	|		Документ.торо_ПроектныеЗатратыНаРемонты.МатериальныеЗатраты КАК тМатериальныеЗатраты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ПроектныеЗатратыНаРемонты КАК торо_ПроектныеЗатратыНаРемонты
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ID КАК ВТ_ID
	|				ПО (ВТ_ID.ID = торо_ПроектныеЗатратыНаРемонты.IDРемонта)
	|			ПО тМатериальныеЗатраты.Ссылка = торо_ПроектныеЗатратыНаРемонты.Ссылка
	|			И торо_ПроектныеЗатратыНаРемонты.ОбъектРемонта В (&ОбъектРемонта)) КАК ВложенныйЗапрос
	|ГДЕ
	|	&ОтборПоНоменклатуре
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Запчасти_ID.Номенклатура КАК Номенклатура,
	|	СУММА(ВТ_Запчасти_ID.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_Запчасти
	|ИЗ
	|	ВТ_Запчасти_ID КАК ВТ_Запчасти_ID
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Запчасти_ID.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	СУММА(ВложенныйЗапрос.Количество) КАК Количество,
	|	ВложенныйЗапрос.ID КАК ID
	|ПОМЕСТИТЬ ВТ_ЗапчастиТекПериод_ID
	|ИЗ
	|	(ВЫБРАТЬ
	|		тЗапчасти.Номенклатура КАК Номенклатура,
	|		тЗапчасти.Количество КАК Количество,
	|		ВТ_ID_ТекПериод.ID КАК ID
	|	ИЗ
	|		Документ.торо_ПроектныеЗатратыНаРемонты.Запчасти КАК тЗапчасти
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ПроектныеЗатратыНаРемонты КАК торо_ПроектныеЗатратыНаРемонты
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ID_ТекПериод КАК ВТ_ID_ТекПериод
	|				ПО (ВТ_ID_ТекПериод.ID = торо_ПроектныеЗатратыНаРемонты.IDРемонта)
	|			ПО тЗапчасти.Ссылка = торо_ПроектныеЗатратыНаРемонты.Ссылка
	|			И торо_ПроектныеЗатратыНаРемонты.ОбъектРемонта В (&ОбъектРемонта)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		тМатериальныеЗатраты.Номенклатура,
	|		тМатериальныеЗатраты.Количество,
	|		ВТ_ID_ТекПериод.ID
	|	ИЗ
	|		Документ.торо_ПроектныеЗатратыНаРемонты.МатериальныеЗатраты КАК тМатериальныеЗатраты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ПроектныеЗатратыНаРемонты КАК торо_ПроектныеЗатратыНаРемонты
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ID_ТекПериод КАК ВТ_ID_ТекПериод
	|				ПО (ВТ_ID_ТекПериод.ID = торо_ПроектныеЗатратыНаРемонты.IDРемонта)
	|			ПО тМатериальныеЗатраты.Ссылка = торо_ПроектныеЗатратыНаРемонты.Ссылка
	|			И торо_ПроектныеЗатратыНаРемонты.ОбъектРемонта В (&ОбъектРемонта)) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗапчастиТекПериод_ID.Номенклатура КАК Номенклатура,
	|	СУММА(ВТ_ЗапчастиТекПериод_ID.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_ЗапчастиТекПериод
	|ИЗ
	|	ВТ_ЗапчастиТекПериод_ID КАК ВТ_ЗапчастиТекПериод_ID
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ЗапчастиТекПериод_ID.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	проф_Назначения.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Назначение
	|ИЗ
	|	Справочник.проф_Назначения КАК проф_Назначения
	|ГДЕ
	|	проф_Назначения.Подразделение = &Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	проф_НастройкиСистемы.Значение КАК Значение
	|ПОМЕСТИТЬ ВТ_ЦентрСклад
	|ИЗ
	|	Справочник.проф_НастройкиСистемы КАК проф_НастройкиСистемы
	|ГДЕ
	|	проф_НастройкиСистемы.Наименование = ""ЦентральныйСкладБилибино""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	проф_НастройкиСистемы.Значение КАК Значение
	|ПОМЕСТИТЬ ВТ_ПодрТОИР
	|ИЗ
	|	Справочник.проф_НастройкиСистемы КАК проф_НастройкиСистемы
	|ГДЕ
	|	проф_НастройкиСистемы.Наименование = ""ПодразделенияСлужбыТОиР""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	тСписок.Значение
	|ИЗ
	|	Справочник.проф_НастройкиСистемы.Список КАК тСписок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.проф_НастройкиСистемы КАК проф_НастройкиСистемы
	|		ПО тСписок.Ссылка = проф_НастройкиСистемы.Ссылка
	|ГДЕ
	|	проф_НастройкиСистемы.Наименование = ""ПодразделенияСлужбыТОиР""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	проф_Назначения.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_НазначениеТОИР
	|ИЗ
	|	Справочник.проф_Назначения КАК проф_Назначения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПодрТОИР КАК ВТ_ПодрТОИР
	|		ПО проф_Назначения.Подразделение = ВТ_ПодрТОИР.Значение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	проф_ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	СУММА(проф_ТоварыНаСкладахОстатки.ВНаличииОстаток) КАК ВНаличииОстаток
	|ПОМЕСТИТЬ ВТ_ТоварыНаСкладахЦС
	|ИЗ
	|	РегистрНакопления.проф_ТоварыНаСкладах.Остатки(
	|			,
	|			(Назначение В
	|					(ВЫБРАТЬ
	|						ВТ_НазначениеТОИР.Ссылка КАК Ссылка
	|					ИЗ
	|						ВТ_НазначениеТОИР КАК ВТ_НазначениеТОИР)
	|				ИЛИ Назначение = ЗНАЧЕНИЕ(Справочник.проф_Назначения.ПустаяСсылка))
	|				И Склад В
	|					(ВЫБРАТЬ
	|						ВТ_ЦентрСклад.Значение КАК Значение
	|					ИЗ
	|						ВТ_ЦентрСклад КАК ВТ_ЦентрСклад)) КАК проф_ТоварыНаСкладахОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	проф_ТоварыНаСкладахОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	проф_ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	СУММА(проф_ТоварыНаСкладахОстатки.ВНаличииОстаток) КАК ВНаличииОстаток
	|ПОМЕСТИТЬ ВТ_ТоварыНаСкладахЦС2
	|ИЗ
	|	РегистрНакопления.проф_ТоварыНаСкладах.Остатки(
	|			,
	|			(Назначение В
	|					(ВЫБРАТЬ
	|						ВТ_НазначениеТОИР.Ссылка КАК Ссылка
	|					ИЗ
	|						ВТ_НазначениеТОИР КАК ВТ_НазначениеТОИР)
	|				ИЛИ Назначение = ЗНАЧЕНИЕ(Справочник.проф_Назначения.ПустаяСсылка))
	|				И Склад В
	|					(ВЫБРАТЬ
	|						ВТ_ЦентрСклад.Значение КАК Значение
	|					ИЗ
	|						ВТ_ЦентрСклад КАК ВТ_ЦентрСклад)) КАК проф_ТоварыНаСкладахОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	проф_ТоварыНаСкладахОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК ВНаличииОстаток
	|ПОМЕСТИТЬ ВТ_ТоварыНаСкладах
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(, &ОтборПоСкладам) КАК ТоварыНаСкладахОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	проф_ЗаказыПоставщикуОстатки.Номенклатура КАК Номенклатура,
	|	СУММА(проф_ЗаказыПоставщикуОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_ЗаказыПоставщику
	|ИЗ
	|	РегистрНакопления.проф_ЗаказыПоставщику.Остатки(
	|			,
	|			Назначение В
	|					(ВЫБРАТЬ
	|						ВТ_НазначениеТОИР.Ссылка КАК Ссылка
	|					ИЗ
	|						ВТ_НазначениеТОИР КАК ВТ_НазначениеТОИР)
	|				И (ЗаказПоставщику.проф_Статус = ЗНАЧЕНИЕ(Перечисление.проф_ПеречислениеСтатусыЗаказовПоставщикам.Подтвержден)
	|					ИЛИ ЗаказПоставщику.проф_Статус = ЗНАЧЕНИЕ(Перечисление.проф_ПеречислениеСтатусыЗаказовПоставщикам.Согласован))) КАК проф_ЗаказыПоставщикуОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	проф_ЗаказыПоставщикуОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_АналогиНоменклатурыДляРемонтовСрезПоследних.Материал КАК Материал,
	|	торо_АналогиНоменклатурыДляРемонтовСрезПоследних.Аналог КАК Аналог,
	|	торо_АналогиНоменклатурыДляРемонтовСрезПоследних.Регистратор.Номер КАК РегистраторНомер,
	|	ВЫРАЗИТЬ(торо_АналогиНоменклатурыДляРемонтовСрезПоследних.Регистратор.УказаниеПоПрименению КАК СТРОКА(250)) КАК УказаниеПоПрименению,
	|	торо_АналогиНоменклатурыДляРемонтовСрезПоследних.Период КАК Период
	|ПОМЕСТИТЬ ВТ_Аналоги
	|ИЗ
	|	РегистрСведений.торо_АналогиНоменклатурыДляРемонтов.СрезПоследних(
	|			,
	|			Материал В
	|				(ВЫБРАТЬ
	|					ВТ_Запчасти.Номенклатура КАК Номенклатура
	|				ИЗ
	|					ВТ_Запчасти КАК ВТ_Запчасти)) КАК торо_АналогиНоменклатурыДляРемонтовСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МинОстаткиНомСрезПоследних.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(МинОстаткиНомСрезПоследних.МинимальныйОстаток) КАК МинимальныйОстаток
	|ПОМЕСТИТЬ ВТ_МинОстаткиНом
	|ИЗ
	|	РегистрСведений.торо_МинимальныеОстаткиНоменклатуры.СрезПоследних КАК МинОстаткиНомСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	МинОстаткиНомСрезПоследних.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	проф_ЗаказыПоставщику.Номенклатура КАК Номенклатура,
	|	проф_ЗаказыПоставщику.ДатаПоставки КАК ДатаПоставки,
	|	проф_ЗаказыПоставщику.Период КАК Период
	|ПОМЕСТИТЬ ВТ_ЗаказыПост
	|ИЗ
	|	РегистрНакопления.проф_ЗаказыПоставщику КАК проф_ЗаказыПоставщику
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Запчасти КАК ВТ_Запчасти
	|		ПО проф_ЗаказыПоставщику.Номенклатура = ВТ_Запчасти.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗаказыПост.Номенклатура КАК Номенклатура,
	|	МИНИМУМ(ВТ_ЗаказыПост.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_ЗаказыПостМин
	|ИЗ
	|	ВТ_ЗаказыПост КАК ВТ_ЗаказыПост
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ЗаказыПост.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗаказыПост.Номенклатура КАК Номенклатура,
	|	ВТ_ЗаказыПост.ДатаПоставки КАК ДатаПоставки,
	|	ВТ_ЗаказыПост.Период КАК Период
	|ПОМЕСТИТЬ ВТ_ЗаказыПостДаты
	|ИЗ
	|	ВТ_ЗаказыПост КАК ВТ_ЗаказыПост
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЗаказыПостМин КАК ВТ_ЗаказыПостМин
	|		ПО ВТ_ЗаказыПост.Номенклатура = ВТ_ЗаказыПостМин.Номенклатура
	|			И ВТ_ЗаказыПост.Период = ВТ_ЗаказыПостМин.Период
	|;
	|
	//++ Проф-ИТ, #377, Соловьев А.А., 30.11.2023
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	проф_ЗапасыИПотребностиОстатки.Номенклатура КАК Номенклатура,
	|	СУММА(проф_ЗапасыИПотребностиОстатки.КОбеспечениюОстаток) КАК КОбеспечению
	|ПОМЕСТИТЬ втЗапасыИПотребностиКОбеспечению
	|ИЗ
	|	РегистрНакопления.проф_ЗапасыИПотребности.Остатки(
	|			&ТекущаяДата,
	|			Номенклатура В
	|				(ВЫБРАТЬ
	|					ВТ_Запчасти.Номенклатура КАК Номенклатура
	|				ИЗ
	|					ВТ_Запчасти КАК ВТ_Запчасти
	|					
	|					ОБЪЕДИНИТЬ ВСЕ 
	|					
	|					ВЫБРАТЬ
	|						ВТ_Аналоги.Аналог
	|					ИЗ
	|						ВТ_Аналоги КАК ВТ_Аналоги)
	|			И Назначение В
	|				(ВЫБРАТЬ
	|					ВТ_НазначениеТОИР.Ссылка КАК Ссылка
	|				ИЗ
	|					ВТ_НазначениеТОИР КАК ВТ_НазначениеТОИР)) КАК проф_ЗапасыИПотребностиОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	проф_ЗапасыИПотребностиОстатки.Номенклатура
	|;
	//-- Проф-ИТ, #377, Соловьев А.А., 30.11.2023
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Запчасти.Номенклатура КАК Номенклатура,
	|	ВТ_Аналоги.Аналог КАК Аналог,
	|	ВТ_Запчасти.Количество КАК ПлановыйРасходПоППР,
	|	ЕСТЬNULL(ВТ_ТоварыНаСкладах.ВНаличииОстаток, 0) КАК ОстаткиНаСкладахТОиРТекущие,
	|	ЕСТЬNULL(ВТ_ТоварыНаСкладахЦС2.ВНаличииОстаток, 0) КАК ОстаткиНаЦентральномСкладе,
	|	ЕСТЬNULL(ВТ_ЗапчастиТекПериод.Количество, 0) КАК ПрогнозныйРасход,
	|	ЕСТЬNULL(втЗапасыИПотребности.КОбеспечению, 0) КАК ЗВП,
	|	ЕСТЬNULL(ВТ_ЗаказыПоставщику.КоличествоОстаток, 0) КАК Заказано,
	|	ЕСТЬNULL(ВТ_МинОстаткиНом.МинимальныйОстаток, 0) КАК МинимальныйОстаток,
	|	ЕСТЬNULL(ВТ_ЗаказыПостДаты.ДатаПоставки, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПоставки
	|ПОМЕСТИТЬ ВТ_МатериалыАналоги
	|ИЗ
	|	ВТ_Запчасти КАК ВТ_Запчасти
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТоварыНаСкладахЦС2 КАК ВТ_ТоварыНаСкладахЦС2
	|		ПО ВТ_Запчасти.Номенклатура = ВТ_ТоварыНаСкладахЦС2.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТоварыНаСкладах КАК ВТ_ТоварыНаСкладах
	|		ПО ВТ_Запчасти.Номенклатура = ВТ_ТоварыНаСкладах.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗапчастиТекПериод КАК ВТ_ЗапчастиТекПериод
	|		ПО ВТ_Запчасти.Номенклатура = ВТ_ЗапчастиТекПериод.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ втЗапасыИПотребностиКОбеспечению КАК втЗапасыИПотребности
	|		ПО ВТ_Запчасти.Номенклатура = втЗапасыИПотребности.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗаказыПоставщику КАК ВТ_ЗаказыПоставщику
	|		ПО ВТ_Запчасти.Номенклатура = ВТ_ЗаказыПоставщику.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Аналоги КАК ВТ_Аналоги
	|		ПО ВТ_Запчасти.Номенклатура = ВТ_Аналоги.Материал
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МинОстаткиНом КАК ВТ_МинОстаткиНом
	|		ПО ВТ_Запчасти.Номенклатура = ВТ_МинОстаткиНом.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗаказыПостДаты КАК ВТ_ЗаказыПостДаты
	|		ПО ВТ_Запчасти.Номенклатура = ВТ_ЗаказыПостДаты.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Аналоги.Аналог КАК Аналог,
	|	ВТ_Аналоги.РегистраторНомер КАК РегистраторНомер,
	|	ВТ_Аналоги.Материал КАК Материал,
	|	ВТ_Аналоги.УказаниеПоПрименению КАК УказаниеПоПрименению,
	|	ВТ_Аналоги.Период КАК Период
	|ПОМЕСТИТЬ ВТ_АналогиФильтр
	|ИЗ
	|	ВТ_Аналоги КАК ВТ_Аналоги
	|;
	//++ Проф-ИТ, #377, Соловьев А.А., 30.11.2023
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Цена) КАК Цена
	|ПОМЕСТИТЬ втЦеныНоменклатуры
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&ТекущаяДата,
	|			(Номенклатура, ВидЦены) В
	|				(ВЫБРАТЬ
	|					ВТ_Запчасти.Номенклатура КАК Номенклатура,
	|					&ТипЦены КАК ВидЦены
	|				ИЗ
	|					ВТ_Запчасти КАК ВТ_Запчасти)) КАК ЦеныНоменклатурыСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Регистр.Склад КАК Склад,
	|	Регистр.Номенклатура КАК Номенклатура,
	|	Регистр.МинимальныйОстаток КАК МинимальныйОстаток
	|ПОМЕСТИТЬ МинимальныеОстатки
	|ИЗ
	|	РегистрСведений.торо_МинимальныеОстаткиНоменклатуры.СрезПоследних(
	|			&ТекущаяДата,
	|			&ОтборПоСкладам
	|				И Номенклатура В
	|					(ВЫБРАТЬ
	|						ВТ_Запчасти.Номенклатура КАК Номенклатура
	|					ИЗ
	|						ВТ_Запчасти КАК ВТ_Запчасти
	|					
	|					ОБЪЕДИНИТЬ ВСЕ 
	|					
	|					ВЫБРАТЬ
	|						ВТ_Аналоги.Аналог
	|					ИЗ
	|						ВТ_Аналоги КАК ВТ_Аналоги)) КАК Регистр
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	проф_ЗапасыИПотребностиОстатки.Номенклатура КАК Номенклатура,
	|	проф_ЗапасыИПотребностиОстатки.Склад КАК Склад,
	|	проф_ЗапасыИПотребностиОстатки.Назначение КАК Назначение,
	|	проф_ЗапасыИПотребностиОстатки.ВНаличииОстаток - проф_ЗапасыИПотребностиОстатки.РезервироватьНаСкладеОстаток - проф_ЗапасыИПотребностиОстатки.РезервироватьПоМереПоступленияОстаток КАК ВНаличии
	|ПОМЕСТИТЬ втЗапасыИПотребностиВНаличии
	|ИЗ
	|	РегистрНакопления.проф_ЗапасыИПотребности.Остатки(
	|			&ТекущаяДата,
	|			Номенклатура В
	|					(ВЫБРАТЬ
	|						ВТ_Запчасти.Номенклатура КАК Номенклатура
	|					ИЗ
	|						ВТ_Запчасти КАК ВТ_Запчасти
	|					
	|					ОБЪЕДИНИТЬ ВСЕ 
	|					
	|					ВЫБРАТЬ
	|						ВТ_Аналоги.Аналог
	|					ИЗ
	|						ВТ_Аналоги КАК ВТ_Аналоги)) КАК проф_ЗапасыИПотребностиОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втЗапасыИПотребности.Номенклатура КАК Номенклатура,
	|	втЗапасыИПотребности.Назначение КАК Назначение,
	|	втЗапасыИПотребности.Склад КАК Склад,
	|	втЗапасыИПотребности.ВНаличии КАК Доступно,
	|	0 КАК РезервНеТОиР
	|ПОМЕСТИТЬ втДоступноРезервНеТОиР
	|ИЗ
	|	втЗапасыИПотребностиВНаличии КАК втЗапасыИПотребности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.проф_Назначения КАК проф_Назначения
	|		ПО втЗапасыИПотребности.Назначение = проф_Назначения.Ссылка
	|			И (проф_Назначения.Подразделение В 
	|				(ВЫБРАТЬ 
	|					ВТ_НазначениеТОИР.Ссылка КАК Ссылка 
	|				ИЗ 
	|					ВТ_НазначениеТОИР КАК ВТ_НазначениеТОИР))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втЗапасыИПотребности.Номенклатура,
	|	втЗапасыИПотребности.Назначение,
	|	втЗапасыИПотребности.Склад,
	|	втЗапасыИПотребности.ВНаличии,
	|	0
	|ИЗ
	|	втЗапасыИПотребностиВНаличии КАК втЗапасыИПотребности
	|ГДЕ
	|	втЗапасыИПотребности.Назначение = ЗНАЧЕНИЕ(Справочник.проф_Назначения.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втЗапасыИПотребности.Номенклатура,
	|	втЗапасыИПотребности.Назначение,
	|	втЗапасыИПотребности.Склад,
	|	0,
	|	втЗапасыИПотребности.ВНаличии
	|ИЗ
	|	втЗапасыИПотребностиВНаличии КАК втЗапасыИПотребности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.проф_Назначения КАК проф_Назначения
	|		ПО втЗапасыИПотребности.Назначение = проф_Назначения.Ссылка
	|			И (НЕ проф_Назначения.Подразделение В 
	|				(ВЫБРАТЬ 
	|					ВТ_НазначениеТОИР.Ссылка КАК Ссылка 
	|				ИЗ 
	|					ВТ_НазначениеТОИР КАК ВТ_НазначениеТОИР))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗапасыИПотребностиПредварительно.Номенклатура КАК Номенклатура,
	|	ЗапасыИПотребностиПредварительно.Склад КАК Склад,
	|	СУММА(ЗапасыИПотребностиПредварительно.КОбеспечениюОстаток) - СУММА(ЗапасыИПотребностиПредварительно.ВНаличииОстаток) КАК Заказано,
	|	СУММА(ЗапасыИПотребностиПредварительно.ПоступитОстаток) КАК Поступит,
	|	СУММА(ЗапасыИПотребностиПредварительно.Доступно) КАК Доступно,
	|	СУММА(ЗапасыИПотребностиПредварительно.РезервНеТОиР) КАК РезервНеТОиР,
	|	СУММА(ЗапасыИПотребностиПредварительно.НаПеремещении) КАК НаПеремещении
	|ПОМЕСТИТЬ втЗапасыИПотребности
	|ИЗ
	|	(ВЫБРАТЬ
	|		проф_ЗапасыИПотребностиОстатки.Номенклатура КАК Номенклатура,
	|		проф_ЗапасыИПотребностиОстатки.Склад КАК Склад,
	|		проф_ЗапасыИПотребностиОстатки.Назначение КАК Назначение,
	|		проф_ЗапасыИПотребностиОстатки.КОбеспечениюОстаток КАК КОбеспечениюОстаток,
	|		проф_ЗапасыИПотребностиОстатки.ВНаличииОстаток КАК ВНаличииОстаток,
	|		0 КАК ПоступитОстаток,
	|		0 КАК Доступно,
	|		0 КАК РезервНеТОиР,
	|		0 КАК НаПеремещении
	|	ИЗ
	|		РегистрНакопления.проф_ЗапасыИПотребности.Остатки(&ТекущаяДата, ) КАК проф_ЗапасыИПотребностиОстатки
	|	ГДЕ
	|		проф_ЗапасыИПотребностиОстатки.КОбеспечениюОстаток > 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		проф_ЗапасыИПотребностиОстатки.Номенклатура,
	|		проф_ЗапасыИПотребностиОстатки.Склад,
	|		проф_ЗапасыИПотребностиОстатки.Назначение,
	|		0,
	|		0,
	|		проф_ЗапасыИПотребностиОстатки.ПоступитОстаток,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		РегистрНакопления.проф_ЗапасыИПотребности.Остатки(&ТекущаяДата, ) КАК проф_ЗапасыИПотребностиОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		втДоступноРезервНеТОиР.Номенклатура,
	|		втДоступноРезервНеТОиР.Склад,
	|		втДоступноРезервНеТОиР.Назначение,
	|		0,
	|		0,
	|		0,
	|		втДоступноРезервНеТОиР.Доступно,
	|		втДоступноРезервНеТОиР.РезервНеТОиР,
	|		0
	|	ИЗ
	|		втДоступноРезервНеТОиР КАК втДоступноРезервНеТОиР
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		проф_ЗаказыНаПеремещениеОстатки.Номенклатура,
	|		проф_ЗаказНаПеремещение.СкладОтправитель,
	|		ЗНАЧЕНИЕ(Справочник.проф_Назначения.ПустаяСсылка),
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		проф_ЗаказыНаПеремещениеОстатки.КОформлениюОстаток
	|	ИЗ
	|		РегистрНакопления.проф_ЗаказыНаПеремещение.Остатки(&ТекущаяДата, ) КАК проф_ЗаказыНаПеремещениеОстатки
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.проф_ЗаказНаПеремещение КАК проф_ЗаказНаПеремещение
	|			ПО проф_ЗаказыНаПеремещениеОстатки.ЗаказНаПеремещение = проф_ЗаказНаПеремещение.Ссылка) КАК ЗапасыИПотребностиПредварительно
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапасыИПотребностиПредварительно.Номенклатура,
	|	ЗапасыИПотребностиПредварительно.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	втЗапасыИПотребности.Номенклатура КАК Номенклатура,
	|	втЗапасыИПотребности.Склад КАК Склад,
	|	СУММА(втЗапасыИПотребности.Доступно) + СУММА(втЗапасыИПотребности.РезервНеТОиР) КАК ОстатокНаСкладе,
	|	СУММА(втЗапасыИПотребности.Доступно) КАК СвободныйОстаток,
	|	СУММА(втЗапасыИПотребности.РезервНеТОиР) КАК Резерв,
	|	СУММА(втЗапасыИПотребности.Заказано) КАК Заказано,
	|	СУММА(втЗапасыИПотребности.Поступит) КАК Поступит,
	|	СУММА(втЗапасыИПотребности.НаПеремещении) КАК НаПеремещении,
	|	МАКСИМУМ(ЕСТЬNULL(МинимальныеОстатки.МинимальныйОстаток, 0)) КАК МинОстаток
	|ИЗ
	|	втЗапасыИПотребности КАК втЗапасыИПотребности
	|		ЛЕВОЕ СОЕДИНЕНИЕ МинимальныеОстатки КАК МинимальныеОстатки
	|		ПО втЗапасыИПотребности.Номенклатура = МинимальныеОстатки.Номенклатура
	|			И втЗапасыИПотребности.Склад = МинимальныеОстатки.Склад
	|
	|СГРУППИРОВАТЬ ПО
	|	втЗапасыИПотребности.Номенклатура,
	|	втЗапасыИПотребности.Склад
	|
	|УПОРЯДОЧИТЬ ПО
	|	Склад
	|;
	//-- Проф-ИТ, #377, Соловьев А.А., 30.11.2023
	//++ Проф-ИТ, #437, Соловьев А.А., 19.01.2024
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	проф_ВнутреннееТовародвижение.Номенклатура КАК Номенклатура,
	|	СУММА(проф_ВнутреннееТовародвижение.Количество) КАК Количество
	|ПОМЕСТИТЬ втТоварыВПутиПоНоменклатуре
	|ИЗ
	|	РегистрСведений.проф_ВнутреннееТовародвижение КАК проф_ВнутреннееТовародвижение
	|ГДЕ
	|	проф_ВнутреннееТовародвижение.Номенклатура В
	|			(ВЫБРАТЬ
	|				ВТ_МатериалыАналоги.Номенклатура
	|			ИЗ
	|				ВТ_МатериалыАналоги КАК ВТ_МатериалыАналоги) И проф_ВнутреннееТовародвижение.Назначение В (ВЫБРАТЬ
	|					ВТ_НазначениеТОИР.Ссылка КАК Ссылка
	|				ИЗ
	|					ВТ_НазначениеТОИР КАК ВТ_НазначениеТОИР)
	|
	|СГРУППИРОВАТЬ ПО
	|	проф_ВнутреннееТовародвижение.Номенклатура
	|;
	//-- Проф-ИТ, #437, Соловьев А.А., 19.01.2024
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_МатериалыАналоги.Номенклатура КАК Номенклатура,
	|	ВТ_МатериалыАналоги.Аналог КАК Аналог,
	|	ВТ_МатериалыАналоги.ПлановыйРасходПоППР КАК ПлановыйРасходПоППР,
	|	ВТ_МатериалыАналоги.ОстаткиНаСкладахТОиРТекущие КАК ОстаткиНаСкладахТОиРТекущие,
	|	ВТ_МатериалыАналоги.ОстаткиНаЦентральномСкладе КАК ОстаткиНаЦентральномСкладе,
	|	ВТ_МатериалыАналоги.ПрогнозныйРасход КАК ПрогнозныйРасход,
	|	ВТ_МатериалыАналоги.ЗВП КАК ЗВП,
	|	ВТ_МатериалыАналоги.Заказано КАК Заказано,
	|	ВТ_МатериалыАналоги.МинимальныйОстаток КАК МинимальныйОстаток,
	//++ Проф-ИТ, #377, Соловьев А.А., 30.11.2023
	|	ЕСТЬNULL(втЦеныНоменклатуры.Цена, 0) КАК ПлановаяЦена,
	//-- Проф-ИТ, #377, Соловьев А.А., 30.11.2023
	//++ Проф-ИТ, #437, Соловьев А.А., 19.01.2024
	|	ВЫБОР
	|		КОГДА ВТ_МатериалыАналоги.Заказано > 0
	|			ТОГДА ЕСТЬNULL(втТоварыВПутиПоНоменклатуре.Количество, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВПути,
	//-- Проф-ИТ, #437, Соловьев А.А., 19.01.2024
	|	ВТ_МатериалыАналоги.ДатаПоставки КАК ПлановаяДатаПоставки
	|ИЗ
	|	ВТ_МатериалыАналоги КАК ВТ_МатериалыАналоги
	//++ Проф-ИТ, #377, Соловьев А.А., 30.11.2023
	|		ЛЕВОЕ СОЕДИНЕНИЕ втЦеныНоменклатуры КАК втЦеныНоменклатуры
	|		ПО ВТ_МатериалыАналоги.Номенклатура = втЦеныНоменклатуры.Номенклатура
	//-- Проф-ИТ, #377, Соловьев А.А., 30.11.2023
	//++ Проф-ИТ, #437, Соловьев А.А., 19.01.2024
	|		ЛЕВОЕ СОЕДИНЕНИЕ втТоварыВПутиПоНоменклатуре КАК втТоварыВПутиПоНоменклатуре
	|		ПО ВТ_МатериалыАналоги.Номенклатура = втТоварыВПутиПоНоменклатуре.Номенклатура
	//-- Проф-ИТ, #437, Соловьев А.А., 19.01.2024
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура
	|ИТОГИ
	|	МАКСИМУМ(ПлановыйРасходПоППР),
	|	МАКСИМУМ(ОстаткиНаСкладахТОиРТекущие),
	|	МАКСИМУМ(ОстаткиНаЦентральномСкладе),
	|	МАКСИМУМ(ПрогнозныйРасход),
	|	МАКСИМУМ(ЗВП),
	|	МАКСИМУМ(Заказано),
	|	МАКСИМУМ(МинимальныйОстаток),
	//++ Проф-ИТ, #377, Соловьев А.А., 30.11.2023
	|	МАКСИМУМ(ПлановаяЦена),
	//-- Проф-ИТ, #377, Соловьев А.А., 30.11.2023
	//++ Проф-ИТ, #437, Соловьев А.А., 19.01.2024
	|	МАКСИМУМ(ВПути),
	//-- Проф-ИТ, #437, Соловьев А.А., 19.01.2024
	|	МАКСИМУМ(ПлановаяДатаПоставки)
	|ПО
	|	Номенклатура
	|АВТОУПОРЯДОЧИВАНИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_АналогиФильтр.Аналог КАК Аналог,
	|	ВТ_АналогиФильтр.Материал КАК Материал,
	|	ВТ_АналогиФильтр.РегистраторНомер КАК РегистраторНомер,
	|	ЕСТЬNULL(ВТ_Запчасти.Номенклатура, НЕОПРЕДЕЛЕНО) КАК Номенклатура,
	|	ЕСТЬNULL(ВТ_ТоварыНаСкладах.ВНаличииОстаток, 0) КАК ОстаткиНаСкладахТОиРТекущие,
	|	ЕСТЬNULL(ВТ_ТоварыНаСкладахЦС.ВНаличииОстаток, 0) КАК ОстаткиНаЦентральномСкладе,
	|	ЕСТЬNULL(втЗапасыИПотребности.КОбеспечению, 0) КАК ЗВП,
	|	ЕСТЬNULL(ВТ_ЗапчастиТекПериод.Количество, 0) КАК ПрогнозныйРасход,
	|	ЕСТЬNULL(ВТ_МинОстаткиНом.МинимальныйОстаток, 0) КАК МинимальныйОстаток,
	|	ЕСТЬNULL(ВТ_ЗаказыПоставщику.КоличествоОстаток, 0) КАК Заказано,
	|	ЕСТЬNULL(ВТ_ЗаказыПостДаты.ДатаПоставки, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПоставки,
	|	ВТ_АналогиФильтр.УказаниеПоПрименению КАК УказаниеПоПрименению,
	|	ВТ_АналогиФильтр.Период КАК Период
	|ИЗ
	|	ВТ_АналогиФильтр КАК ВТ_АналогиФильтр
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТоварыНаСкладахЦС КАК ВТ_ТоварыНаСкладахЦС
	|		ПО ВТ_АналогиФильтр.Аналог = ВТ_ТоварыНаСкладахЦС.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТоварыНаСкладах КАК ВТ_ТоварыНаСкладах
	|		ПО ВТ_АналогиФильтр.Аналог = ВТ_ТоварыНаСкладах.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Запчасти КАК ВТ_Запчасти
	|		ПО ВТ_АналогиФильтр.Аналог = ВТ_Запчасти.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗапчастиТекПериод КАК ВТ_ЗапчастиТекПериод
	|		ПО ВТ_АналогиФильтр.Аналог = ВТ_ЗапчастиТекПериод.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ втЗапасыИПотребностиКОбеспечению КАК втЗапасыИПотребности
	|		ПО ВТ_АналогиФильтр.Аналог = втЗапасыИПотребности.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МинОстаткиНом КАК ВТ_МинОстаткиНом
	|		ПО ВТ_АналогиФильтр.Аналог = ВТ_МинОстаткиНом.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗаказыПоставщику КАК ВТ_ЗаказыПоставщику
	|		ПО ВТ_АналогиФильтр.Аналог = ВТ_ЗаказыПоставщику.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗаказыПостДаты КАК ВТ_ЗаказыПостДаты
	|		ПО ВТ_АналогиФильтр.Аналог = ВТ_ЗаказыПостДаты.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Запчасти_ID.Номенклатура КАК Номенклатура,
	|	ВТ_ID_Регистратор.Регистратор КАК Документ
	|ИЗ
	|	ВТ_ID_Регистратор КАК ВТ_ID_Регистратор
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Запчасти_ID КАК ВТ_Запчасти_ID
	|		ПО ВТ_ID_Регистратор.ID = ВТ_Запчасти_ID.ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ЗапчастиТекПериод_ID.Номенклатура КАК Номенклатура,
	|	ВТ_ID_ТекПериод_Регистратор.Регистратор КАК Документ
	|ИЗ
	|	ВТ_ID_ТекПериод_Регистратор КАК ВТ_ID_ТекПериод_Регистратор
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЗапчастиТекПериод_ID КАК ВТ_ЗапчастиТекПериод_ID
	|		ПО ВТ_ID_ТекПериод_Регистратор.ID = ВТ_ЗапчастиТекПериод_ID.ID";
	
	Запрос.УстановитьПараметр("Подразделение", Объект.ПодразделениеИсполнитель);
	Запрос.УстановитьПараметр("ДатаПлана", Объект.ДатаПлана);
	Запрос.УстановитьПараметр("ДатаНачала", Объект.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Объект.ДатаОкончания)); 
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоНоменклатуре", "ВложенныйЗапрос.Номенклатура В ИЕРАРХИИ (&Номенклатура)");
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Иначе
		Запрос.УстановитьПараметр("ОтборПоНоменклатуре", Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Склады) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоСкладам", "Склад В ИЕРАРХИИ (&Склады)");
		Запрос.УстановитьПараметр("Склады", Склады);
	Иначе
		Запрос.УстановитьПараметр("ОтборПоСкладам", Истина);
	КонецЕсли;
	
	//++ Проф-ИТ, #377, Соловьев А.А., 30.11.2023
	Если ОбъектРемонта.Количество() = 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, 
			"И торо_ПроектныеЗатратыНаРемонты.ОбъектРемонта В (&ОбъектРемонта)", "");
	Иначе
		Запрос.УстановитьПараметр("ОбъектРемонта", ОбъектРемонта);
	КонецЕсли;
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ТипЦены", ТипЦены);
	//-- Проф-ИТ, #377, Соловьев А.А., 30.11.2023
	
	мсвРезультатов = Запрос.ВыполнитьПакет();  
	КолРез = мсвРезультатов.ВГраница(); 
	ВыборкаНоменклатура = мсвРезультатов[КолРез - 3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ТаблицаАналоги = мсвРезультатов[КолРез - 2].Выгрузить(); 
	
	//++ Проф-ИТ, #377, Соловьев А.А., 30.11.2023
	ОстаткиПоСкладам.Загрузить(мсвРезультатов[КолРез - 4].Выгрузить()); 
	//-- Проф-ИТ, #377, Соловьев А.А., 30.11.2023
	
	ТаблицаПлановыйРасход          = мсвРезультатов[КолРез - 1].Выгрузить();
	ТаблицаПлановыйРасходТекПериод = мсвРезультатов[КолРез].Выгрузить();
	ДокументыПланРасход.Загрузить(ТаблицаПлановыйРасход);
	ДокументыПланРасходТекПериод.Загрузить(ТаблицаПлановыйРасходТекПериод);
	
	ЭлементыКорняДерева = МатериалыДерево.ПолучитьЭлементы();
	
	Пока ВыборкаНоменклатура.Следующий() Цикл
		СтрокаНоменклатура = ЭлементыКорняДерева.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНоменклатура, ВыборкаНоменклатура);
		СтрокаНоменклатура.ПрогнозныеОстаткиНаСкладах = ВыборкаНоменклатура.ОстаткиНаСкладахТОиРТекущие
														+ ВыборкаНоменклатура.ОстаткиНаЦентральномСкладе
														- ВыборкаНоменклатура.ПрогнозныйРасход
														+ ВыборкаНоменклатура.Заказано;
		
		Если Объект.ИспользоватьАналоги Тогда
			СтрокаНоменклатура.РекомендованоКЗакупке = ВыборкаНоменклатура.ПлановыйРасходПоППР 
														- СтрокаНоменклатура.ПрогнозныеОстаткиНаСкладах 
														+ ВыборкаНоменклатура.МинимальныйОстаток
														- СтрокаНоменклатура.ИспользоватьАналог
														+ СтрокаНоменклатура.ЗапланированоАналог;
		Иначе
			СтрокаНоменклатура.РекомендованоКЗакупке = ВыборкаНоменклатура.ПлановыйРасходПоППР 
														- СтрокаНоменклатура.ПрогнозныеОстаткиНаСкладах 
														+ ВыборкаНоменклатура.МинимальныйОстаток;
		КонецЕсли;
		СтрокаНоменклатура.РекомендованоКЗакупке = ?(СтрокаНоменклатура.РекомендованоКЗакупке < 0, 0, СтрокаНоменклатура.РекомендованоКЗакупке);
		
		СтрокаНоменклатура.ПланЗакупок = СтрокаНоменклатура.РекомендованоКЗакупке; 
		
		//++ Проф-ИТ, #377, Соловьев А.А., 30.11.2023
		СтрокаНоменклатура.ПлановаяСтоимость = СтрокаНоменклатура.ПлановаяЦена * СтрокаНоменклатура.РекомендованоКЗакупке;
		//-- Проф-ИТ, #377, Соловьев А.А., 30.11.2023
		
		Если Объект.ИспользоватьАналоги Тогда
			
			СтрокиАналоги = СтрокаНоменклатура.ПолучитьЭлементы();
			
			СтруктураОтбора = Новый Структура("Материал", СтрокаНоменклатура.Номенклатура);
			НайденныеСтроки = ТаблицаАналоги.НайтиСтроки(СтруктураОтбора);
			Для каждого текСтрока Из НайденныеСтроки Цикл
				СтрокаАналог = СтрокиАналоги.Добавить(); 
				СтрокаАналог.Номенклатура         = текСтрока.Аналог;
				СтрокаАналог.НоменклатураРодитель = текСтрока.Материал;
				СтрокаНоменклатура.ЕстьАналоги = Истина;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	ВыборкаНоменклатура.Сбросить();
	
	ВыборкаАналоги = мсвРезультатов[КолРез - 2].Выбрать();
	Пока ВыборкаАналоги.Следующий() Цикл 
		новСтрока = Аналоги.Добавить();
		ЗаполнитьЗначенияСвойств(новСтрока, ВыборкаАналоги);
		
		Если ВыборкаАналоги.Номенклатура <> Неопределено Тогда
			СтруктураПоиска = Новый Структура("Номенклатура", ВыборкаАналоги.Номенклатура);
			
			ВыборкаНоменклатура.Сбросить();
			
			ПересчитатьНераспределённыйОстатокВСтроке(новСтрока);
			
		КонецЕсли;
		
		новСтрока.ПрогнозныеОстаткиНаСкладах = ВыборкаАналоги.ОстаткиНаСкладахТОиРТекущие
														+ ВыборкаАналоги.ОстаткиНаЦентральномСкладе
														- ВыборкаАналоги.ПрогнозныйРасход
														+ ВыборкаАналоги.Заказано;   
		
		новСтрока.НомерДатаРазрешения = ВыборкаАналоги.РегистраторНомер + ", " + ВыборкаАналоги.Период;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСуммуИспользоватьАналог(текАналог)
	
	ИспользоватьАналогСумма = 0;
	ЭлементыКорняДерева = МатериалыДерево.ПолучитьЭлементы();
	Для каждого СтрокаНоменклатура Из ЭлементыКорняДерева Цикл
		СтрокиАналоги = СтрокаНоменклатура.ПолучитьЭлементы();
		
		Для каждого СтрокаАналог Из СтрокиАналоги Цикл
			Если СтрокаАналог.Номенклатура = текАналог Тогда
			    ИспользоватьАналогСумма = ИспользоватьАналогСумма + СтрокаАналог.ИспользоватьАналог;
			КонецЕсли;
		КонецЦикла;			
		
	КонецЦикла; 
	
	Возврат ИспользоватьАналогСумма;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДокументНаСервере(ДанныеФормы)
	
	ЭлементыКорняДерева = МатериалыДерево.ПолучитьЭлементы();   
	
	ДокПланЗакупок = Документы.проф_ПланЗакупок.СоздатьДокумент();
	ДокПланЗакупок.Дата = Объект.ДатаПлана;
	ДокПланЗакупок.НачалоПериода = Объект.ДатаНачала;
	ДокПланЗакупок.ОкончаниеПериода = Объект.ДатаОкончания;	
	ДокПланЗакупок.Подразделение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"НастройкиТОиР",
		"ОсновноеПодразделение",
		Справочники.СтруктураПредприятия.ПустаяСсылка());
		
	ДокПланЗакупок.Ответственный = Объект.Ответственный;   
	
	текСклад = Справочники.проф_НастройкиСистемы.ПолучитьНастройкуСистемы(
					"ФормированиеЗаказовНаВнутреннееПотребление", "СкладПоУмолчанию");
	ДокПланЗакупок.Склад = текСклад;
	
	Для каждого СтрокаНоменклатура Из ЭлементыКорняДерева Цикл
		
		Если СтрокаНоменклатура.ПометитьКФормированиюПланаЗакупок = Истина Тогда
		    новСтрока = ДокПланЗакупок.Товары.Добавить();
			новСтрока.Номенклатура = СтрокаНоменклатура.Номенклатура;
			новСтрока.Количество = СтрокаНоменклатура.РекомендованоКЗакупке; 
			СтрокаНоменклатура.СозданДокумент = Истина;
		КонецЕсли;
		
		СтрокиАналоги = СтрокаНоменклатура.ПолучитьЭлементы();
		Для каждого СтрокаАналог Из СтрокиАналоги Цикл
			Если СтрокаАналог.ПометитьКФормированиюПланаЗакупок = Истина Тогда
				новСтрока = ДокПланЗакупок.Товары.Добавить();
				новСтрока.Номенклатура = СтрокаАналог.Номенклатура; 
				
				новСтрока.Количество = СтрокаАналог.РекомендованоКЗакупке;
				СтрокаАналог.СозданДокумент = Истина;
			КонецЕсли; 
		КонецЦикла;	
		
	КонецЦикла; 
	
	ЗначениеВДанныеФормы(ДокПланЗакупок, ДанныеФормы);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовИспользоватьАналоги()
	
	Элементы.МатериалыДеревоИспользоватьАналог.Видимость  = Объект.ИспользоватьАналоги;
	Элементы.МатериалыДеревоЗапланированоАналог.Видимость = Объект.ИспользоватьАналоги;	
	Элементы.Аналоги.Видимость = Объект.ИспользоватьАналоги;                           
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьНераспределённыйОстатокВСтроке(текСтрока)
	
	Если текСтрока.ПрогнозныеОстаткиНаСкладах = 0 Тогда
		текСтрока.НераспределенныйОстаток = текСтрока.ОстаткиНаСкладахТОиРТекущие
		+ текСтрока.ОстаткиНаЦентральномСкладе
		- текСтрока.ИспользоватьАналог;
	Иначе
		текСтрока.НераспределенныйОстаток = текСтрока.ОстаткиНаСкладахТОиРТекущие
		- текСтрока.ИспользоватьАналог;		 
	КонецЕсли;	
	
КонецПроцедуры // ПересчитатьНераспределённыйОстатокВСтроке()

#КонецОбласти

//-- Проф-ИТ, #167, Сергеев Д., 15.09.2023
